// 3. Напишите программу, которая выводит массив из 8 элементов, 
// заполненный нулями и единицами в случайном порядке. 


void ArrayFill(int[] array)
	{
	    for (int i = 0; i < array.Length; i++)
	    {
	        array[i] = new Random().Next(0, 11);
	    }
	}
	
	void ArrayPrint(int[] array)
	{
	    for (int i = 0; i < array.Length; i++)
	    {
	        Console.Write($"{array[i]} ");
	    }
	}
	
	int[] array = new int[8];
	ArrayFill(array);
	ArrayPrint(array);